owhinata/stm32f746g-disco/port/camera/camera.c
	cam_ready = 1;
	LOG_INF("I2C1 + DCMI/DMA2-S1 up; sensor I/O is lazy");
	return 0;

fail_i2c:
	(void)HAL_I2C_DeInit(&hcam_i2c);
fail:
	tx_semaphore_delete(&cam_done);
	tx_mutex_delete(&cam_lock);
	return CAM_ERR_HAL;
}

/* ---- ISRs + HAL completion callbacks ------------------------------------- */
/*
 * Strong overrides of the CMSIS weak vectors, wrapped in the ThreadX
 * execution-profile enter/exit exactly like the SD driver's (sd_card.c):
 * these only fire during a capture, which is started from a shell thread
 * long after the profile kit is armed.
 */
void DCMI_IRQHandler(void)
{
#if defined(TX_EXECUTION_PROFILE_ENABLE)
	{ uint32_t pm = __get_PRIMASK(); __disable_irq();
	  _tx_execution_isr_enter(); __set_PRIMASK(pm); }
#endif
	HAL_DCMI_IRQHandler(&hdcmi);
#if defined(TX_EXECUTION_PROFILE_ENABLE)
	{ uint32_t pm = __get_PRIMASK(); __disable_irq();
	  _tx_execution_isr_exit(); __set_PRIMASK(pm); }
#endif
}

void DMA2_Stream1_IRQHandler(void)
{
#if defined(TX_EXECUTION_PROFILE_ENABLE)
	{ uint32_t pm = __get_PRIMASK(); __disable_irq();
	  _tx_execution_isr_enter(); __set_PRIMASK(pm); }
#endif
	HAL_DMA_IRQHandler(&hdma_dcmi);
#if defined(TX_EXECUTION_PROFILE_ENABLE)
	{ uint32_t pm = __get_PRIMASK(); __disable_irq();
	  _tx_execution_isr_exit(); __set_PRIMASK(pm); }
#endif
}

/* Frame complete: the DMA finished the frame's words (DCMI_DMAXferCplt armed
   the FRAME interrupt) and the DCMI saw the frame end.  Posted only while a
   capture is in flight; a late post after a timeout/stop is suppressed by
   the cam_xfer_active gate and removed by the next drain. */
void HAL_DCMI_FrameEventCallback(DCMI_HandleTypeDef *h)
{
	(void)h;
	if (!cam_xfer_active)
		return;
	(void)tx_semaphore_put(&cam_done);
}

/* Sync error, overrun and DMA errors all funnel here via the HAL. */
void HAL_DCMI_ErrorCallback(DCMI_HandleTypeDef *h)
{
	(void)h;
	if (!cam_xfer_active)
		return;
	cam_xfer_err = 1;
	(void)tx_semaphore_put(&cam_done);
}
